



单元综合测试一 


2. 标志着集成电路技术进入微电子时代的是： 
A . 大规模集成电路的使用 
D.   集成电路技术的使用   


答：   A。       随着大规模集成电路和微处理器的出现，计算机进入第四代。大规模集成电路的使用标志着集成电路技术进入微电子时代。



4. 在翻译过程中，翻译程序翻译一句执行一句，该翻译程序称为： 解释程序 





10， 表达式的值为0的是： 

A.   5/5%5
C.   !4 
D.    0x7&7  

答：C。     A 中 / 和 % 优先级相同，最终为1.      D 为位逻辑运算，结果仍为7. 




12. 设 int a =1,b=2,c=3,d=4,f; 
执行语句 f=(a! =b)?c++:d++;
后f的值是： 3  




16.1946年世界上诞生的第一台电子计算机是：  电子数字积分计算机 

17. 机器语言和汇编语言都是面向机器的语言，也称为： 低级语言 


18. 利用计算机语言将所要解决问题中的数据以及处理问题的方法和步骤进行完整而准确地描述，这一描述的过程称为： 程序设计



19.  C语言中具有特殊含义的单词称为(关键字),又称为"保留字",主要用作构成语句。




20. C语言的转移语句包括goto语句、break语句、(  continue语句 ) 和return语句。 





21. 八进制整型常量025的十进制表示为： ( 21)


22. 如果要将表达式(3*4.5)强制转换成长整型，应该写成  :    (long)(3*4.5) 




23.C语言中 ，语句的最后一定要有的一个符号是:   ;










24. 循环结构通常分为：(当型)循环结构、直到型循环结构和次数型循环结构三种。

25.  执行语句 x=5;if(x!=0) x=1; 后,变量x的值是：       1 












































