


2019.10 

11. 在window操作系统下安装jdk后，需要正确设置系统的环境变量(  path )  和classpath.

12. 在java 类中定义的 double 型成员变量的默认初始值是 (  0.0 ) 


13. 以下语句执行的结果是( 149 )

for(int i=0,s=0;i<5;i++)
{
	s+=++i;
	System.out.print(s);
}


14. 在java 语言中，调用类的(  构造方法 ) 是生成实例对象的唯一途径。

15.System 类中提供了一个可以实现数组复制的方法，这个方法的名字是(  arraycopy )


16. 当父类中原有的方法不能满足子类的要求时，在子类中修改父类已有的方法，这就是(  方法覆写(或方法重写)   )

17. 在java 语言中， 创建(  File  )类的对象后即可使用其中的方法来获取特定文件的路径信息。


18.在java 语言中，为每个事件类型提供了一个(    倾听程序接口  ) ,它规定了接收并处理该类事件的方法的规范。

19. 在java 语言中， 用于创建标准对话框的类是:(   JOptionPane );

20. 在java 语言中， 能够释放所有等待线程的方法的名字是： (   	notifyAll  ) 




21:  请分别写出在类和方法中声明的变量的作用域。


答： 类中声明的变量的作用域是整个类，方法中声明的变量的作用域是从该变量的声明处开始到包含该声明的语句块结束处。

22.   请分别写出类定义中使用public 、 private 、 protected 和默认修饰符所修饰的成员的访问权限。

答： 1、 用 public 修饰的成员可以被其他任何对象访问。
2、 用 private 修饰的成员只能在本类内访问。 
3、 用 protected 修饰的成员只可以被同一包及其子类的实例对象访问。




23. 请写出对象转型的2条使用规则。

答： 1、 沿类层次向"上"转型总是合法的，此种方式下不需要转型运算符。
2、 对于向"下"转型 ， 只能是祖先类转型到后代类， 且要使用显式转换， 其他类之间是不允许的。









24.  请写出Swing 中提供的4种顶层容器。

答： JFrame 、JApplet 、JDialog 和 JWindow 


25. 请写出 java 语言中线程的组成内容及其调度方式。

答：  线程由3部分组成： 虚拟CPU 、 执行的代码 、处理的数据。
线程采用抢占式调度方式。







-- 




